# RebarContainerItem Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarContainerItem Class
Members See Also
---
Provides implementation for Rebar stored in RebarContainer.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public class RebarContainerItem : IDisposable
```

Visual Basic
---
```text
Public Class RebarContainerItem _
	Implements IDisposable
```

Visual C++
---
```text
public ref class RebarContainerItem : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure..::..RebarContainerItem
# See Also
RebarContainerItem Members
Autodesk.Revit.DB.Structure Namespace